Revit 2027 API
UIApplication.RegisterContextMenu Method
Adds a new context menu creator.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RegisterContextMenu(
	string fullClassName,
	IContextMenuCreator creator
)
Public Sub RegisterContextMenu (
	fullClassName As String,
	creator As IContextMenuCreator
)
public:
void RegisterContextMenu(
	String^ fullClassName,
	IContextMenuCreator^ creator
)
member RegisterContextMenu :
        fullClassName : string *
        creator : IContextMenuCreator -> unit
Parameters
fullClassName String
FullClassName of the application.
creator IContextMenuCreator
Your add-in's implementation of the IContextMenuCreator interface.
Remarks
For details about the use of IContextMenuCreator, see IContextMenuCreator.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace